# Subsetting and Descriptive Stats

## Before your start:
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [3]:
# import libraries here
import pandas as pd
from sqlalchemy import create_engine

# Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [7]:
# your code here

connection_string = 'mysql+pymysql://ironhacker_read:ir0nhack3r@35.239.232.23/temp_states'
    
engine = create_engine(connection_string)

query = """
        SELECT * FROM temp_states
"""

temp = pd.read_sql(query, engine)

#### Print `temp`.

In [8]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [9]:
# your code here
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
City           7 non-null object
State          7 non-null object
Temperature    7 non-null float64
dtypes: float64(1), object(2)
memory usage: 240.0+ bytes

In [ ]:
"""
your comments here:

We have strings, called objects for DataFrame, for City and State columns and a float for the temperature.
"""

#### Select the rows where state is New York.

In [12]:
# your code here
ny = temp[temp['State'] == 'New York']

#### What is the average temperature of cities in New York?

In [15]:
# your code here
ny.groupby(['State']).mean()

          Temperature
State
New York    10.740741

#### Which states and cities have a temperature above 15 degrees Celsius?

In [16]:
# your code here
temp[temp['Temperature'] > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [32]:
# your code here
hot_cities = temp[temp['Temperature'] > 15]
list(hot_cities['City'])

['NYC', 'Hartford', 'Treton', 'Newark']

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [33]:
# your code here
not_that_hot_cities = hot_cities[hot_cities['Temperature'] < 20]
list(not_that_hot_cities['City'])

['NYC', 'Hartford']

#### Find the mean and standard deviation of the temperature of each state.

In [40]:
# your code here
state_temp = temp.groupby(['State']).mean()
state_temp['STD'] = temp.groupby(['State']).std()
state_temp

             Temperature       STD
State
Connecticut    15.833333  1.964186
New Jersey     21.111111  1.571348
New York       10.740741  8.133404

# Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [45]:
# your code here
connection_string2 = 'mysql+pymysql://ironhacker_read:ir0nhack3r@35.239.232.23/employees'
    
engine2 = create_engine(connection_string2)

query2 = """
        SELECT * FROM employees
"""

employees = pd.read_sql(query2, engine2)

#### Explore the data types of the `employees` dataframe. Comment your results.

In [46]:
# your code here
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
Name          9 non-null object
Department    9 non-null object
Education     9 non-null object
Gender        9 non-null object
Title         9 non-null object
Years         9 non-null int64
Salary        9 non-null int64
dtypes: int64(2), object(5)
memory usage: 576.0+ bytes

In [47]:
"""
your comments here:


We have objects for all the columns except for Year and Salary, which are integers.
"""

'\nyour comments here\n\nWe have objects for all the columns except for Year and Salary, which are integers.\n'

#### What's the average salary in this company?

In [54]:
# your code here
print('Average salary:', employees['Salary'].mean())

('Average salary:', 48.888888888888886)

#### What's the highest salary?

In [55]:
# your code here
print('Max salary:', employees['Salary'].max())

('Max salary:', 70)

#### What's the lowest salary?

In [56]:
# your code here
print('Min salary:', employees['Salary'].min())

('Min salary:', 30)

#### Who are the employees with the lowest salary?

In [61]:
# your code here
# We will consider the 3 employees with the lowest salary:

list(employees.sort_values(by='Salary')['Name'][0:3])

['Maria', 'David', 'Jose']

#### Find all the information about an employee called David.

In [63]:
# your code here
employees[employees['Name'] == 'Jose']

   Name Department Education Gender    Title  Years  Salary
0  Jose         IT  Bachelor      M  analyst      1      35

#### Could you return only David's salary?

In [67]:
# your code here
print("David's Salary: ", int(employees[employees['Name'] == 'David']['Salary']))

("David's Salary: ", 30)

#### Print all the rows where job title is associate.

In [68]:
# your code here
employees[employees['Title'] == 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [70]:
# Method 1
# your code here
employees[0:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [72]:
# Method 2
# your code here
employees.iloc[0:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [73]:
# your code here
employees[employees['Title'] == 'associate'][employees['Salary'] > 55]

/anaconda3/envs/py3/lib/python2.7/site-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [76]:
# your code here
by_years = employees.groupby('Years').mean()
by_years

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [87]:
# your code here
by_title = employees.groupby('Title').mean()['Salary']
pd.DataFrame(by_title)

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [91]:
# your code here
set(pd.qcut(employees['Salary'], 4))

{Interval(29.999, 35.0, closed='right'),
 Interval(35.0, 55.0, closed='right'),
 Interval(55.0, 60.0, closed='right'),
 Interval(60.0, 70.0, closed='right')}

#### Is the mean salary different per gender?

In [94]:
# your code here
employees.groupby('Gender').mean()['Salary']

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [100]:
# your code here
employees.groupby('Department').agg(['min','mean','max'])

           Years               Salary
             min      mean max    min   mean max
Department
HR             2  4.666667   8     30  45.00  70
IT             1  4.500000   8     30  48.75  70
Sales          2  2.500000   3     55  55.00  55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [113]:
# your code here
employees.groupby('Department')['Salary'].agg([('Diff', lambda x: max(x) - min(x))])

            Diff
Department
HR            40
IT            40
Sales          0

# Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [4]:
# your code here
connection_string3 = 'mysql+pymysql://ironhacker_read:ir0nhack3r@35.239.232.23/orders'
    
engine3 = create_engine(connection_string3)

query3 = """
        SELECT * FROM orders
"""

orders = pd.read_sql(query3, engine3)

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [5]:
# your code here
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397924 entries, 0 to 397923
Data columns (total 14 columns):
index           397924 non-null int64
InvoiceNo       397924 non-null int64
StockCode       397924 non-null object
year            397924 non-null int64
month           397924 non-null int64
day             397924 non-null int64
hour            397924 non-null int64
Description     397924 non-null object
Quantity        397924 non-null int64
InvoiceDate     397924 non-null object
UnitPrice       397924 non-null float64
CustomerID      397924 non-null int64
Country         397924 non-null object
amount_spent    397924 non-null float64
dtypes: float64(2), int64(8), object(4)
memory usage: 42.5+ MB

In [ ]:
"""
your comments here

objects, integers for date columns and float por price and amounts

"""

####  What is the average purchase price?

In [6]:
# your code here
orders['UnitPrice'].mean()

3.1161744805540756

#### What are the highest and lowest purchase prices?

In [7]:
# your code here
print("Min:", orders['UnitPrice'].min()
, "Max:", orders['UnitPrice'].max())

('Min:', 0.0, 'Max:', 8142.75)

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [25]:
# your code here
# i don't know why groupby does not work for cust id
spanish_cust = orders[orders['Country'] == 'Spain'].groupby('CustomerID').sum()
spanish_cust

,index,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,,
12354,6561395,31952838,116638,232,232,754,530,261.22,1079.40
12417,2680972,12682154,46253,92,92,299,267,72.05,436.30
12421,8379981,25167687,90495,282,178,538,484,203.41,807.04
12442,4701570,6971460,24132,144,24,168,182,40.08,172.06
12445,1410550,2308500,8044,44,16,72,62,31.95,133.40
12448,6754077,12603492,44242,220,66,286,243,130.94,449.45
12450,1331076,4462114,16088,50,48,112,128,12.94,197.88
12454,4337040,8568825,30165,150,75,255,1006,109.23,3528.34
12455,9825237,26985556,96528,366,156,626,566,177.24,767.96
12462,10014897,34448972,124682,322,142,758,536,290.75,1189.59
12484,61087224,193177283,695806,2152,1907,4594,2191,1081.63,4541.72
12502,21117275,81550414,295617,829,455,1541,820,944.51,3723.87
12507,2473924,12122225,44242,89,49,263,905,102.12,1304.81
12510,1841632,17945667,66363,57,70,446,353,140.69,982.57
12538,7064379,12089847,42231,231,84,357,191,76.51,363.95
12539,25882448,149603034,549003,791,725,3123,2067,1140.19,5568.35
12540,89378300,267468854,961238,3408,1275,6050,6685,1838.89,13400.24
12541,11005312,29217735,104572,381,258,558,680,188.02,981.18
12544,6098924,10911719,38209,209,76,304,136,78.02,372.70
12545,7122887,27715724,100550,246,282,616,523,201.19,1000.39
12546,18693579,39297168,138759,645,249,693,633,220.75,1161.50
12547,708902,4383466,16088,28,38,96,134,63.60,207.80
12548,846585,2790540,10055,30,35,75,49,33.60,95.20
12550,14283801,32356221,114627,513,171,798,569,176.15,964.83
12551,232925,5393510,20100,120,50,110,100,16.80,168.00
12556,28171657,68389065,243331,1009,283,1573,358,322.14,603.71
12557,4688807,18284069,66358,228,65,443,4384,71.83,11990.96
12596,5098233,15107442,54297,180,51,351,474,118.95,618.27
12597,50357649,116542636,414266,1670,1178,2852,2236,812.07,3811.22
17097,47936455,118835244,424281,1992,604,3208,459,546.87,954.42

#### How many customers do we have in Spain?

In [26]:
# your code here
spanish_cust.shape[0]

30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [54]:
# your code here

totalquantity = orders.groupby('CustomerID').sum()
totalquantity[['Quantity']][totalquantity['Quantity'] > 50].head()

            Quantity
CustomerID
12346          74215
12347           2458
12348           2341
12349            631
12350            197

#### Select orders from Spain that include more than 50 items.

In [55]:
# your code here
spanish_cust[['Quantity']][spanish_cust['Quantity'] > 50].head()

            Quantity
CustomerID
12354            530
12417            267
12421            484
12442            182
12445             62

#### Select all free orders.

In [56]:
# your code here
orders[orders['amount_spent'] == 0].head()

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
6914,6914,537197,22841,2010,12,7,14,round cake tin vintage green,1,2010-12-05 14:02:00,0.0,12647,Germany,0.0
22539,22539,539263,22580,2010,12,4,14,advent calendar gingham sack,4,2010-12-16 14:36:00,0.0,16560,United Kingdom,0.0
25379,25379,539722,22423,2010,12,2,13,regency cakestand 3 tier,10,2010-12-21 13:45:00,0.0,14911,EIRE,0.0
29080,29080,540372,22090,2011,1,4,16,paper bunting retrospot,24,2011-01-06 16:41:00,0.0,13081,United Kingdom,0.0
29082,29082,540372,22553,2011,1,4,16,plasters in tin skulls,24,2011-01-06 16:41:00,0.0,13081,United Kingdom,0.0

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [41]:
# your code here
lunch_bag = orders[orders['Description'].str.startswith('lunch bag')]
lunch_bag.head()

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
93,93,536378,20725,2010,12,3,9,lunch bag red retrospot,10,2010-12-01 09:37:00,1.65,14688,United Kingdom,16.50
172,172,536385,22662,2010,12,3,9,lunch bag dolly girl design,10,2010-12-01 09:56:00,1.65,17420,United Kingdom,16.50
354,354,536401,22662,2010,12,3,11,lunch bag dolly girl design,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
359,359,536401,20725,2010,12,3,11,lunch bag red retrospot,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
360,360,536401,22382,2010,12,3,11,lunch bag spaceboy design,2,2010-12-01 11:21:00,1.65,15862,United Kingdom,3.30

#### Select all `lunch bag` orders made in 2011.

In [44]:
# your code here
lunch_bag[lunch_bag['year'] == 2011].head()

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
26340,26340,540015,20725,2011,1,2,11,lunch bag red retrospot,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26341,26341,540015,20726,2011,1,2,11,lunch bag woodland,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26512,26512,540023,22382,2011,1,2,12,lunch bag spaceboy design,2,2011-01-04 12:58:00,1.65,15039,United Kingdom,3.30
26513,26513,540023,20726,2011,1,2,12,lunch bag woodland,1,2011-01-04 12:58:00,1.65,15039,United Kingdom,1.65
26860,26860,540098,22384,2011,1,2,15,lunch bag pink polkadot,1,2011-01-04 15:50:00,1.65,16241,United Kingdom,1.65

#### Show the frequency distribution of the amount spent in Spain.

In [45]:
# your code here
spanish_cust['amount_spent'].sum()

61577.10999999998

#### Select all orders made in the month of August.

In [49]:
# your code here
august = orders[orders['month'] == 8]
august.head()

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
199475,199475,561904,22075,2011,8,1,8,6 ribbons elegant christmas,96,2011-08-01 08:30:00,1.45,17941,United Kingdom,139.20
199476,199476,561904,85049E,2011,8,1,8,scandinavian reds ribbons,156,2011-08-01 08:30:00,1.06,17941,United Kingdom,165.36
199477,199477,561905,21385,2011,8,1,9,ivory hanging decoration heart,24,2011-08-01 09:31:00,0.85,14947,United Kingdom,20.40
199478,199478,561905,84970L,2011,8,1,9,single heart zinc t-light holder,12,2011-08-01 09:31:00,0.95,14947,United Kingdom,11.40
199479,199479,561905,84970S,2011,8,1,9,hanging heart zinc t-light holder,12,2011-08-01 09:31:00,0.85,14947,United Kingdom,10.20

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [66]:
# your code here
pd.DataFrame(august.groupby('Country').count()['index'])

                 index
Country
Australia          107
Austria             88
Belgium            194
Canada               5
Channel Islands    140
Denmark             16
EIRE               593
Finland             61
France             569
Germany            795
Iceland             22
Israel             171
Italy               95
Malta               55
Netherlands        280
Norway              77
Poland              17
Portugal            41
Spain              252
Sweden              40
Switzerland        267
United Kingdom   23105
Unspecified         23

#### What's the  average amount of money spent by country?

In [70]:
# your code here
pd.DataFrame(orders.groupby('Country').mean()['amount_spent'])

                      amount_spent
Country
Australia               116.895620
Austria                  25.624824
Bahrain                  32.258824
Belgium                  20.283772
Brazil                   35.737500
Canada                   24.280662
Channel Islands          27.340160
Cyprus                   22.134169
Czech Republic           33.069600
Denmark                  49.882474
EIRE                     36.687745
European Community       21.670833
Finland                  32.913985
France                   25.056827
Germany                  25.311562
Greece                   32.831172
Iceland                  23.681319
Israel                   29.119718
Italy                    23.064960
Japan                   116.561900
Lebanon                  37.641778
Lithuania                47.458857
Malta                    24.335625
Netherlands             120.798282
Norway                   33.736418
Poland                   22.226212
Portugal                 22.872702
RSA                      17.281207
Saudi Arabia             16.213333
Singapore                95.852658
Spain                    24.779521
Sweden                   85.096075
Switzerland              30.642752
USA                      20.002179
United Arab Emirates     27.974706
United Kingdom           20.625073
Unspecified              10.930615

#### What's the most expensive item?

In [74]:
# your code here
orders[orders['UnitPrice'] == orders['UnitPrice'].max()]

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
118352,118352,551697,POST,2011,5,2,13,postage,1,2011-05-03 13:46:00,8142.75,16029,United Kingdom,8142.75

#### What is the average amount spent per year?

In [82]:
# your code here
orders.groupby('year').mean()['amount_spent']

year
2010    21.892733
2011    22.430074
Name: amount_spent, dtype: float64